[
    {
        "vs"        : ["zerg"],
        "strategy"  : "Aggressive",
        "difficulty": "2",
        "name"      : "Хэлбат-пуш",
        "units"     : ["Хэлбаты","Морпехи","Медиваки"],
        "paragraph" : "В начале игры нашей целью является заказ раннего Рипера, с помощью которого мы тщательно разведываем противника, в то время как развиваем свою базу. Рипер должен определить ставит ли противник вторую Хату или остаётся на одной. Так же важно узнать когда противник поставил Пул и Газилку.Если Зерг не ставит вторую Хату, это наводит на мысль, что он готовит однобазовый all-in. Нужно будет оперативно принять меры. В таком случае, для защиты, мы будем строить один или два Бункера у себя на рампе, а вокруг закрывать проходы Саплаями. Кроме того, мы отменяем строительство второго Командного Центра и прекращаем производство КСМ. Все минералы нам понадобятся для постройки войск, которые позволят отбить атаку Зерга. Если же однобазовая агрессия Зерга нам не угрожает, то мы продолжаем развиваться по основному билду. Но мы остаёмся уязвимы для двухбазового пуша Рачами. Рипер всё ещё очень важен для нас, поэтому мы не должны его потерять ни в коем случае. Он должен находиться у выхода из базы противника, чтобы предупредить нас об атаке как можно раньше. Если Зерг действительно пойдёт в атаку с двух баз, то с помощью Рипера мы сможем вовремя на это отреагировать, подстроив в срочном порядке дополнительные Бункеры. Мы используем первые Геллионы вместе с Рипером, чтобы оказать давление на оппонента, заставляя Зерга занять оборонительную позицию. При этом у нас нет цели нанести какой-либо урон. Мы лишь пытаемся предотвратить распростронение Крипа. В то же время мы не должны ни в коем случае терять Геллионы, так как это ослабит нашу настоящую атаку. Кроме того, возле базы противника не должно быть более 4 Геллионов, чтобы противник не знал точно с каким именно билдом Террана он имеет дело. Для того чтобы пресечь разведку Оверами, мы можем оставить несколько Мариков на своей базе на патруле. Таким образом, можно сбивать Оверлордов ещё на подлёте. При правильном исполнении билда, атака происходит в Тайминг5:20 с несколькими Морпехами, Геллионами (которые трансформируются для нападения в Хелбатов) и двумя Медиваками. Чтобы извлечь максимальную выгоду из нашей атаки, стоит нападать на вторую Хату противника. Таким образом Зерг не может собрать свою армию с трёх Нычек в одном месте и может терять много юнитов на Муве.",
        "buildOrder": ["Газ до барака", "Рипер", "Орбиталка и 2 цц как накопятся 400 минералов", "2 саплай факта как только хватит газа", "Реактор на барак", "Бункер 2 газ и 2 орбиталка", "Старпорт, перелет факты на реактор","Массим гелики","Лаба на бараке 3 соплай","Стимпак 2 медивака армори"],
        "link"      : "https://www.youtube.com/embed/DPIG8TnP12M"
    },
    {
        "vs"        : ["protos"],
        "strategy"  : "All-in",
        "difficulty": "3",
        "name"      : "Двухбазовый ММММ",
        "units"     : ["Минки","Морпехи","Марадеры","Медиваки","Либератор","Танк"],
        "paragraph" : "Постоянное давление на Протосса с появлением первых Медеваков, обязательно сохранять Медеваки как можно дольше. Занятие грамотной позиции для принятия сражений с помощью Танка и Мин.",
        "buildOrder": ["Газ до барака", "Рипер", "Орбиталка и 2 цц как накопятся 400 минералов", "2 саплай факта как только хватит газа","Реактор на барак","2 газ гелион", "Старпорт", "Массим мариков минка орбиталка", "Сейфовый викинг минка", "Лаба к факте танк инжинерка","Взлет барака делаем на нем лабу","+ 2 барака","+1 пехоте на факту реактор","стимпак 3 и 4 газ","реактор старпорту щиты марикам","Масим мародеров","Под таиминг медиваков делаем выход"],
        "link"      : "https://www.youtube.com/embed/9cKGhGZ046M"
    },
    {
        "vs"        : ["terran"],
        "strategy"  : "macro",
        "difficulty": "1",
        "name"      : "TvT - Терран против Террана. Стратегии за Терранов",
        "units"     : ["Морпехи","Медиваки","Танки"],
        "paragraph" : "200 лимита танкомариков - хороший винрейт в голде Открываемся в стандарт, на 10-11 минуте ставим 3ю, копим 200 лимита танкомариков (в первую очередь тратим газ!) будет пачка мариков, ~10 танков и 8-10 медиваков. грейды примерно уже 3-3 должны быть заказаны. Выезжаем нагибать террана. Если боимся дропов, можно заказать туреток. Раскладываемся под натуралом или осаждаем зелнагу, если враг там. Враг естественно паникует, концентрирует силы в одной точке. Тут мы делаем масс дроп мариков на мейн, и сразу мариков в дозаказ на поддержку танков."
    }
]
